advanced/frontend/controllers/IndexController.php

SELECT * FROM `keke_witkey_ad` WHERE ad_position = 'global'
---
    public function actionAd(){
       $ad = KekeWitkeyAd::find()->where("ad_position = 'global'")->all();

SELECT * FROM `keke_witkey_task` WHERE 1=1 ORDER BY `start_time` DESC LIMIT 15
---
    public function actionTesklist(){
        $task = \app\models\KekeWitkeyTask::find()->orderBy("start_time desc ")->limit("15")->where("1=1")->all();