advanced/frontend/controllers/LoginController.php

SELECT * FROM `keke_witkey_space` WHERE username = 'admin'
---
    public function actionLogin()
    {
        $this->layout='@app/views/layouts/colume.php';
		if(!empty($_POST)){
			 $username=$_POST['txt_account'];
			 $password=$_POST['pwd_password'];
			 $info = KekeWitkeySpace::find()->where("username = '".$username."'")->one();