advanced/frontend/controllers/SellerController.php

    public function actionSellerlist()
    {
    	$this->layout='@app/views/layouts/colume.php';

        $where = "keke_witkey_space.uid=keke_witkey_shop.uid and 1=1";
       	$data["indu"] = KekeWitkeyIndustry::find()->where(['indus_pid' => '0'])->all();
        $model = new Query();
        $info=$model->from(['keke_witkey_space','keke_witkey_shop'])
             ->where($where);
        $pages = new Pagination(['totalCount' =>$info->count(), 'pageSize' => '4']);
        $data['model'] = $info->offset($pages->offset)->where("$where")->limit($pages->limit)->all();
---
SELECT * FROM `keke_witkey_industry` WHERE `indus_pid`='0'
SELECT COUNT(*) FROM `keke_witkey_space`, `keke_witkey_shop` WHERE keke_witkey_space.uid=keke_witkey_shop.uid and 1=1
SELECT * FROM `keke_witkey_space`, `keke_witkey_shop` WHERE keke_witkey_space.uid=keke_witkey_shop.uid and 1=1 LIMIT 4